Revit 2027 API
ParameterFilterElement.ElementFilterIsAcceptableForParameterFilterElement Method
Overload List
Name | Description
ElementFilterIsAcceptableForParameterFilterElement(ElementFilter) |  Checks that an ElementFilter is acceptable for use in defining the filtering rules for a ParameterFilterElement (i.e., for view filtering).
ElementFilterIsAcceptableForParameterFilterElement(Document, ISet<ElementId>, ElementFilter) |  Checks that an ElementFilter is acceptable for use in defining the filtering rules for a given list of categories (i.e., for view filtering).
Top
See Also
Reference
ParameterFilterElement Class
Autodesk.Revit.DB Namespace